Revit 2027 API
BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView Property
 You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsAlreadyDisplacedInView { get; }
Public Shared ReadOnly Property ElementsAlreadyDisplacedInView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsAlreadyDisplacedInView {
	FailureDefinitionId^ get ();
}
static member ElementsAlreadyDisplacedInView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DisplacementElementFailures Class
Autodesk.Revit.DB Namespace